tutorials/multiphase/MRFMultiphaseInterFoam/mixerVessel2D/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// General macros to create 2D/extruded-2D meshes












// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

// Hub radius


// Impeller-tip radius


// Baffle-tip radius


// Tank radius


// MRF region radius


// Thickness of 2D slab


// Base z


// Top z


// Number of cells radially between hub and impeller tip


// Number of cells radially in each of the two regions between
// impeller and baffle tips


// Number of cells radially between baffle tip and tank


// Number of cells azimuthally in each of the 8 blocks


// Number of cells in the thickness of the slab


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //














































































































































































































































// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (0.2 0 0) // Vertex r0b = 0
    (0.2 0 0) // Vertex r0sb = 1
    (0.141421356364228 -0.141421356110391 0) // Vertex r1b = 2
    (3.58979347393082e-10 -0.2 0) // Vertex r2b = 3
    (3.58979347393082e-10 -0.2 0) // Vertex r2sb = 4
    (-0.141421355856554 -0.141421356618065 0) // Vertex r3b = 5
    (-0.2 7.17958694786164e-10 0) // Vertex r4b = 6
    (-0.2 7.17958694786164e-10 0) // Vertex r4sb = 7
    (-0.141421355856554 0.141421356618065 0) // Vertex r5b = 8
    (3.58979347393082e-10 0.2 0) // Vertex r6b = 9
    (3.58979347393082e-10 0.2 0) // Vertex r6sb = 10
    (0.141421356364228 0.141421356110391 0) // Vertex r7b = 11

    (0.5 0 0) // Vertex rb0b = 12
    (0.353553390910569 -0.353553390275978 0) // Vertex rb1b = 13
    (8.97448368482705e-10 -0.5 0) // Vertex rb2b = 14
    (-0.353553389641386 -0.353553391545162 0) // Vertex rb3b = 15
    (-0.5 1.79489673696541e-09 0) // Vertex rb4b = 16
    (-0.353553389641386 0.353553391545162 0) // Vertex rb5b = 17
    (8.97448368482705e-10 0.5 0) // Vertex rb6b = 18
    (0.353553390910569 0.353553390275978 0) // Vertex rb7b = 19

    (0.6 0 0) // Vertex ri0b = 20
    (0.424264069092683 -0.424264068331174 0) // Vertex ri1b = 21
    (1.07693804217925e-09 -0.6 0) // Vertex ri2b = 22
    (-0.424264067569663 -0.424264069854194 0) // Vertex ri3b = 23
    (-0.6 2.15387608435849e-09 0) // Vertex ri4b = 24
    (-0.424264067569663 0.424264069854194 0) // Vertex ri5b = 25
    (1.07693804217925e-09 0.6 0) // Vertex ri6b = 26
    (0.424264069092683 0.424264068331174 0) // Vertex ri7b = 27

    (0.7 0 0) // Vertex Rb0b = 28
    (0.494974747274797 -0.494974746386369 0) // Vertex Rb1b = 29
    (1.25642771587579e-09 -0.7 0) // Vertex Rb2b = 30
    (-0.49497474549794 -0.494974748163226 0) // Vertex Rb3b = 31
    (-0.7 2.51285543175157e-09 0) // Vertex Rb4b = 32
    (-0.49497474549794 0.494974748163226 0) // Vertex Rb5b = 33
    (1.25642771587579e-09 0.7 0) // Vertex Rb6b = 34
    (0.494974747274797 0.494974746386369 0) // Vertex Rb7b = 35

    (1 0 0) // Vertex R0b = 36
    (0.707106781821139 -0.707106780551956 0) // Vertex R1b = 37
    (0.707106781821139 -0.707106780551956 0) // Vertex R1sb = 38
    (1.79489673696541e-09 -1 0) // Vertex R2b = 39
    (-0.707106779282772 -0.707106783090323 0) // Vertex R3b = 40
    (-0.707106779282772 -0.707106783090323 0) // Vertex R3sb = 41
    (-1 3.58979347393082e-09 0) // Vertex R4b = 42
    (-0.707106779282772 0.707106783090323 0) // Vertex R5b = 43
    (-0.707106779282772 0.707106783090323 0) // Vertex R5sb = 44
    (1.79489673696541e-09 1 0) // Vertex R6b = 45
    (0.707106781821139 0.707106780551956 0) // Vertex R7b = 46
    (0.707106781821139 0.707106780551956 0) // Vertex R7sb = 47

    (0.2 0 0.1) // Vertex r0t = 48
    (0.2 0 0.1) // Vertex r0st = 49
    (0.141421356364228 -0.141421356110391 0.1) // Vertex r1t = 50
    (3.58979347393082e-10 -0.2 0.1) // Vertex r2t = 51
    (3.58979347393082e-10 -0.2 0.1) // Vertex r2st = 52
    (-0.141421355856554 -0.141421356618065 0.1) // Vertex r3t = 53
    (-0.2 7.17958694786164e-10 0.1) // Vertex r4t = 54
    (-0.2 7.17958694786164e-10 0.1) // Vertex r4st = 55
    (-0.141421355856554 0.141421356618065 0.1) // Vertex r5t = 56
    (3.58979347393082e-10 0.2 0.1) // Vertex r6t = 57
    (3.58979347393082e-10 0.2 0.1) // Vertex r6st = 58
    (0.141421356364228 0.141421356110391 0.1) // Vertex r7t = 59

    (0.5 0 0.1) // Vertex rb0t = 60
    (0.353553390910569 -0.353553390275978 0.1) // Vertex rb1t = 61
    (8.97448368482705e-10 -0.5 0.1) // Vertex rb2t = 62
    (-0.353553389641386 -0.353553391545162 0.1) // Vertex rb3t = 63
    (-0.5 1.79489673696541e-09 0.1) // Vertex rb4t = 64
    (-0.353553389641386 0.353553391545162 0.1) // Vertex rb5t = 65
    (8.97448368482705e-10 0.5 0.1) // Vertex rb6t = 66
    (0.353553390910569 0.353553390275978 0.1) // Vertex rb7t = 67

    (0.6 0 0.1) // Vertex ri0t = 68
    (0.424264069092683 -0.424264068331174 0.1) // Vertex ri1t = 69
    (1.07693804217925e-09 -0.6 0.1) // Vertex ri2t = 70
    (-0.424264067569663 -0.424264069854194 0.1) // Vertex ri3t = 71
    (-0.6 2.15387608435849e-09 0.1) // Vertex ri4t = 72
    (-0.424264067569663 0.424264069854194 0.1) // Vertex ri5t = 73
    (1.07693804217925e-09 0.6 0.1) // Vertex ri6t = 74
    (0.424264069092683 0.424264068331174 0.1) // Vertex ri7t = 75

    (0.7 0 0.1) // Vertex Rb0t = 76
    (0.494974747274797 -0.494974746386369 0.1) // Vertex Rb1t = 77
    (1.25642771587579e-09 -0.7 0.1) // Vertex Rb2t = 78
    (-0.49497474549794 -0.494974748163226 0.1) // Vertex Rb3t = 79
    (-0.7 2.51285543175157e-09 0.1) // Vertex Rb4t = 80
    (-0.49497474549794 0.494974748163226 0.1) // Vertex Rb5t = 81
    (1.25642771587579e-09 0.7 0.1) // Vertex Rb6t = 82
    (0.494974747274797 0.494974746386369 0.1) // Vertex Rb7t = 83

    (1 0 0.1) // Vertex R0t = 84
    (0.707106781821139 -0.707106780551956 0.1) // Vertex R1t = 85
    (0.707106781821139 -0.707106780551956 0.1) // Vertex R1st = 86
    (1.79489673696541e-09 -1 0.1) // Vertex R2t = 87
    (-0.707106779282772 -0.707106783090323 0.1) // Vertex R3t = 88
    (-0.707106779282772 -0.707106783090323 0.1) // Vertex R3st = 89
    (-1 3.58979347393082e-09 0.1) // Vertex R4t = 90
    (-0.707106779282772 0.707106783090323 0.1) // Vertex R5t = 91
    (-0.707106779282772 0.707106783090323 0.1) // Vertex R5st = 92
    (1.79489673696541e-09 1 0.1) // Vertex R6t = 93
    (0.707106781821139 0.707106780551956 0.1) // Vertex R7t = 94
    (0.707106781821139 0.707106780551956 0.1) // Vertex R7st = 95
);

blocks
(
    // block0
    hex (0 2 13 12 48 50 61 60)
    rotor
    (12 12 1)
    simpleGrading (1 1 1)

    // block1
    hex (2 4 14 13 50 52 62 61)
    rotor
    (12 12 1)
    simpleGrading (1 1 1)

    // block2
    hex (3 5 15 14 51 53 63 62)
    rotor
    (12 12 1)
    simpleGrading (1 1 1)

    // block3
    hex (5 7 16 15 53 55 64 63)
    rotor
    (12 12 1)
    simpleGrading (1 1 1)

    // block4
    hex (6 8 17 16 54 56 65 64)
    rotor
    (12 12 1)
    simpleGrading (1 1 1)

    // block5
    hex (8 10 18 17 56 58 66 65)
    rotor
    (12 12 1)
    simpleGrading (1 1 1)

    // block6
    hex (9 11 19 18 57 59 67 66)
    rotor
    (12 12 1)
    simpleGrading (1 1 1)

    // block7
    hex (11 1 12 19 59 49 60 67)
    rotor
    (12 12 1)
    simpleGrading (1 1 1)

    // block0
    hex (12 13 21 20 60 61 69 68)
    rotor
    (12 4 1)
    simpleGrading (1 1 1)

    // block1
    hex (13 14 22 21 61 62 70 69)
    rotor
    (12 4 1)
    simpleGrading (1 1 1)

    // block2
    hex (14 15 23 22 62 63 71 70)
    rotor
    (12 4 1)
    simpleGrading (1 1 1)

    // block3
    hex (15 16 24 23 63 64 72 71)
    rotor
    (12 4 1)
    simpleGrading (1 1 1)

    // block4
    hex (16 17 25 24 64 65 73 72)
    rotor
    (12 4 1)
    simpleGrading (1 1 1)

    // block5
    hex (17 18 26 25 65 66 74 73)
    rotor
    (12 4 1)
    simpleGrading (1 1 1)

    // block6
    hex (18 19 27 26 66 67 75 74)
    rotor
    (12 4 1)
    simpleGrading (1 1 1)

    // block7
    hex (19 12 20 27 67 60 68 75)
    rotor
    (12 4 1)
    simpleGrading (1 1 1)

    // block0
    hex (20 21 29 28 68 69 77 76)
    (12 4 1)
    simpleGrading (1 1 1)

    // block1
    hex (21 22 30 29 69 70 78 77)
    (12 4 1)
    simpleGrading (1 1 1)

    // block2
    hex (22 23 31 30 70 71 79 78)
    (12 4 1)
    simpleGrading (1 1 1)

    // block3
    hex (23 24 32 31 71 72 80 79)
    (12 4 1)
    simpleGrading (1 1 1)

    // block4
    hex (24 25 33 32 72 73 81 80)
    (12 4 1)
    simpleGrading (1 1 1)

    // block5
    hex (25 26 34 33 73 74 82 81)
    (12 4 1)
    simpleGrading (1 1 1)

    // block6
    hex (26 27 35 34 74 75 83 82)
    (12 4 1)
    simpleGrading (1 1 1)

    // block7
    hex (27 20 28 35 75 68 76 83)
    (12 4 1)
    simpleGrading (1 1 1)

    // block0
    hex (28 29 38 36 76 77 86 84)
    (12 12 1)
    simpleGrading (1 1 1)

    // block1
    hex (29 30 39 37 77 78 87 85)
    (12 12 1)
    simpleGrading (1 1 1)

    // block2
    hex (30 31 41 39 78 79 89 87)
    (12 12 1)
    simpleGrading (1 1 1)

    // block3
    hex (31 32 42 40 79 80 90 88)
    (12 12 1)
    simpleGrading (1 1 1)

    // block4
    hex (32 33 44 42 80 81 92 90)
    (12 12 1)
    simpleGrading (1 1 1)

    // block5
    hex (33 34 45 43 81 82 93 91)
    (12 12 1)
    simpleGrading (1 1 1)

    // block6
    hex (34 35 47 45 82 83 95 93)
    (12 12 1)
    simpleGrading (1 1 1)

    // block7
    hex (35 28 36 46 83 76 84 94)
    (12 12 1)
    simpleGrading (1 1 1)
);

edges
(
    arc 0 2 (0.184775906536601 -0.0765366863901046 0)
    arc 2 4 (0.0765366867217582 -0.184775906399226 0)
    arc 3 5 (-0.0765366860584508 -0.184775906673977 0)
    arc 5 7 (-0.18477590626185 -0.0765366870534118 0)
    arc 6 8 (-0.18477590626185 0.0765366870534118 0)
    arc 8 10 (-0.0765366860584508 0.184775906673977 0)
    arc 9 11 (0.0765366867217582 0.184775906399226 0)
    arc 11 1 (0.184775906536601 0.0765366863901046 0)

    arc 12 13 (0.461939766341503 -0.191341715975262 0)
    arc 13 14 (0.191341716804395 -0.461939765998065 0)
    arc 14 15 (-0.191341715146127 -0.461939766684942 0)
    arc 15 16 (-0.461939765654626 -0.19134171763353 0)
    arc 16 17 (-0.461939765654626 0.19134171763353 0)
    arc 17 18 (-0.191341715146127 0.461939766684942 0)
    arc 18 19 (0.191341716804395 0.461939765998065 0)
    arc 19 12 (0.461939766341503 0.191341715975262 0)

    arc 20 21 (0.554327719609804 -0.229610059170314 0)
    arc 21 22 (0.229610060165275 -0.554327719197677 0)
    arc 22 23 (-0.229610058175352 -0.55432772002193 0)
    arc 23 24 (-0.554327718785551 -0.229610061160235 0)
    arc 24 25 (-0.554327718785551 0.229610061160235 0)
    arc 25 26 (-0.229610058175352 0.55432772002193 0)
    arc 26 27 (0.229610060165275 0.554327719197677 0)
    arc 27 20 (0.554327719609804 0.229610059170314 0)

    arc 28 29 (0.646715672878104 -0.267878402365366 0)
    arc 29 30 (0.267878403526154 -0.64671567239729 0)
    arc 30 31 (-0.267878401204578 -0.646715673358918 0)
    arc 31 32 (-0.646715671916476 -0.267878404686941 0)
    arc 32 33 (-0.646715671916476 0.267878404686941 0)
    arc 33 34 (-0.267878401204578 0.646715673358918 0)
    arc 34 35 (0.267878403526154 0.64671567239729 0)
    arc 35 28 (0.646715672878104 0.267878402365366 0)

    arc 36 38 (0.923879532683006 -0.382683431950523 0)
    arc 37 39 (0.382683433608791 -0.923879531996129 0)
    arc 39 41 (-0.382683430292254 -0.923879533369883 0)
    arc 40 42 (-0.923879531309252 -0.382683435267059 0)
    arc 42 44 (-0.923879531309252 0.382683435267059 0)
    arc 43 45 (-0.382683430292254 0.923879533369883 0)
    arc 45 47 (0.382683433608791 0.923879531996129 0)
    arc 46 36 (0.923879532683006 0.382683431950523 0)

    arc 48 50 (0.184775906536601 -0.0765366863901046 0.1)
    arc 50 52 (0.0765366867217582 -0.184775906399226 0.1)
    arc 51 53 (-0.0765366860584508 -0.184775906673977 0.1)
    arc 53 55 (-0.18477590626185 -0.0765366870534118 0.1)
    arc 54 56 (-0.18477590626185 0.0765366870534118 0.1)
    arc 56 58 (-0.0765366860584508 0.184775906673977 0.1)
    arc 57 59 (0.0765366867217582 0.184775906399226 0.1)
    arc 59 49 (0.184775906536601 0.0765366863901046 0.1)

    arc 60 61 (0.461939766341503 -0.191341715975262 0.1)
    arc 61 62 (0.191341716804395 -0.461939765998065 0.1)
    arc 62 63 (-0.191341715146127 -0.461939766684942 0.1)
    arc 63 64 (-0.461939765654626 -0.19134171763353 0.1)
    arc 64 65 (-0.461939765654626 0.19134171763353 0.1)
    arc 65 66 (-0.191341715146127 0.461939766684942 0.1)
    arc 66 67 (0.191341716804395 0.461939765998065 0.1)
    arc 67 60 (0.461939766341503 0.191341715975262 0.1)

    arc 68 69 (0.554327719609804 -0.229610059170314 0.1)
    arc 69 70 (0.229610060165275 -0.554327719197677 0.1)
    arc 70 71 (-0.229610058175352 -0.55432772002193 0.1)
    arc 71 72 (-0.554327718785551 -0.229610061160235 0.1)
    arc 72 73 (-0.554327718785551 0.229610061160235 0.1)
    arc 73 74 (-0.229610058175352 0.55432772002193 0.1)
    arc 74 75 (0.229610060165275 0.554327719197677 0.1)
    arc 75 68 (0.554327719609804 0.229610059170314 0.1)

    arc 76 77 (0.646715672878104 -0.267878402365366 0.1)
    arc 77 78 (0.267878403526154 -0.64671567239729 0.1)
    arc 78 79 (-0.267878401204578 -0.646715673358918 0.1)
    arc 79 80 (-0.646715671916476 -0.267878404686941 0.1)
    arc 80 81 (-0.646715671916476 0.267878404686941 0.1)
    arc 81 82 (-0.267878401204578 0.646715673358918 0.1)
    arc 82 83 (0.267878403526154 0.64671567239729 0.1)
    arc 83 76 (0.646715672878104 0.267878402365366 0.1)

    arc 84 86 (0.923879532683006 -0.382683431950523 0.1)
    arc 85 87 (0.382683433608791 -0.923879531996129 0.1)
    arc 87 89 (-0.382683430292254 -0.923879533369883 0.1)
    arc 88 90 (-0.923879531309252 -0.382683435267059 0.1)
    arc 90 92 (-0.923879531309252 0.382683435267059 0.1)
    arc 91 93 (-0.382683430292254 0.923879533369883 0.1)
    arc 93 95 (0.382683433608791 0.923879531996129 0.1)
    arc 94 84 (0.923879532683006 0.382683431950523 0.1)
);

patches
(
    wall rotor
    (
        (0 2 50 48)
        (2 4 52 50)
        (3 5 53 51)
        (5 7 55 53)
        (6 8 56 54)
        (8 10 58 56)
        (9 11 59 57)
        (11 1 49 59)

        (0 12 60 48)
        (1 12 60 49)

        (3 14 62 51)
        (4 14 62 52)

        (6 16 64 54)
        (7 16 64 55)

        (9 18 66 57)
        (10 18 66 58)
    )

    wall stator
    (
        (36 38 86 84)
        (37 39 87 85)
        (39 41 89 87)
        (40 42 90 88)
        (42 44 92 90)
        (43 45 93 91)
        (45 47 95 93)
        (46 36 84 94)

        (37 29 77 85)
        (38 29 77 86)

        (40 31 79 88)
        (41 31 79 89)

        (43 33 81 91)
        (44 33 81 92)

        (46 35 83 94)
        (47 35 83 95)
    )

    empty front
    (
        (48 50 61 60)
        (50 52 62 61)
        (51 53 63 62)
        (53 55 64 63)
        (54 56 65 64)
        (56 58 66 65)
        (57 59 67 66)
        (59 49 60 67)
        (60 61 69 68)
        (61 62 70 69)
        (62 63 71 70)
        (63 64 72 71)
        (64 65 73 72)
        (65 66 74 73)
        (66 67 75 74)
        (67 60 68 75)
        (68 69 77 76)
        (69 70 78 77)
        (70 71 79 78)
        (71 72 80 79)
        (72 73 81 80)
        (73 74 82 81)
        (74 75 83 82)
        (75 68 76 83)
        (76 77 86 84)
        (77 78 87 85)
        (78 79 89 87)
        (79 80 90 88)
        (80 81 92 90)
        (81 82 93 91)
        (82 83 95 93)
        (83 76 84 94)
    )

    empty back
    (
        (0 12 13 2)
        (2 13 14 4)
        (3 14 15 5)
        (5 15 16 7)
        (6 16 17 8)
        (8 17 18 10)
        (9 18 19 11)
        (11 19 12 1)
        (12 20 21 13)
        (13 21 22 14)
        (14 22 23 15)
        (15 23 24 16)
        (16 24 25 17)
        (17 25 26 18)
        (18 26 27 19)
        (19 27 20 12)
        (20 28 29 21)
        (21 29 30 22)
        (22 30 31 23)
        (23 31 32 24)
        (24 32 33 25)
        (25 33 34 26)
        (26 34 35 27)
        (27 35 28 20)
        (28 36 38 29)
        (29 37 39 30)
        (30 39 41 31)
        (31 40 42 32)
        (32 42 44 33)
        (33 43 45 34)
        (34 45 47 35)
        (35 46 36 28)
    )
);

// ************************************************************************* //
